# Categorical Encoding

Machines understand numbers, not text. We need to convert each text category 
to numbers in order for the machine to process them using mathematical equations

To convert categorical columns to numerical columns so that a machine 
learning algorithm understands it. This process is called categorical encoding.

# Label Encoding

In [1]:
import pandas as pd
import numpy as np

In [5]:
Employee={
    'Department':['Sales','HR' ,'DataScience','Finance','HR','Finance'],
    'Age':[44,34,26,35,23,30],
    'Salary':[72000,65000,80000,35000,30000,40000]
}
Employee

{'Age': [44, 34, 26, 35, 23, 30],
 'Department': ['Sales', 'HR', 'DataScience', 'Finance', 'HR', 'Finance'],
 'Salary': [72000, 65000, 80000, 35000, 30000, 40000]}

In [6]:
data=pd.DataFrame(Employee)

In [7]:
data

   Age   Department  Salary
0   44        Sales   72000
1   34           HR   65000
2   26  DataScience   80000
3   35      Finance   35000
4   23           HR   30000
5   30      Finance   40000

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Age           6 non-null int64
Department    6 non-null object
Salary        6 non-null int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

Department, is the categorical feature as it is represented by the object data type and 
the rest of them are numerical features as they are represented by int64.

# implement label encoding in Python

In [9]:
# Import label encoder
from sklearn import preprocessing
# label_encoder object knows how to understand word labels.
label_encoder=preprocessing.LabelEncoder()

In [12]:
# Encode labels in column 'Department'-inalphabetic order
data['Department']= label_encoder.fit_transform(data['Department']) 
data

   Age  Department  Salary
0   44           3   72000
1   34           2   65000
2   26           0   80000
3   35           1   35000
4   23           2   30000
5   30           1   40000

label encoding uses alphabetical ordering. 
Hence, DataScience has been encoded with 0, the Finance with 1,HR with 2

Challenges with Label Encoding
In the above scenario, the Department names do not have an order or rank. 
But, when label encoding is performed, the Department names are ranked based on the alphabets. 
Due to this, there is a very high probability that the model captures 
the relationship between countries such as-DataScience < Finance <HR< Sales

# Using pandas to create dummy variables

In [25]:
dummies = pd.get_dummies(data.Department)
dummies

   DataScience  Finance  HR  Sales
0            0        0   0      1
1            0        0   1      0
2            1        0   0      0
3            0        1   0      0
4            0        0   1      0
5            0        1   0      0

In [26]:
merged = pd.concat([data,dummies],axis='columns')
merged

   Age   Department  Salary  DataScience  Finance  HR  Sales
0   44        Sales   72000            0        0   0      1
1   34           HR   65000            0        0   1      0
2   26  DataScience   80000            1        0   0      0
3   35      Finance   35000            0        1   0      0
4   23           HR   30000            0        0   1      0
5   30      Finance   40000            0        1   0      0

In [27]:
final = merged.drop(['Department'], axis='columns')
final

   Age  Salary  DataScience  Finance  HR  Sales
0   44   72000            0        0   0      1
1   34   65000            0        0   1      0
2   26   80000            1        0   0      0
3   35   35000            0        1   0      0
4   23   30000            0        0   1      0
5   30   40000            0        1   0      0